---
title: LoadFailures
classe: Autodesk.Revit.DB.BuiltInFailures+LoadFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# LoadFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AreaLoadNotOverlappingHost { get; }` | `LoadFailures.AreaLoadNotOverlappingHost` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyHostedLoad { get; }` | `LoadFailures.CannotCopyHostedLoad` | FailureDefinitionId |
| `FailureDefinitionId CannotMirrorHostedLoad { get; }` | `LoadFailures.CannotMirrorHostedLoad` | FailureDefinitionId |
| `FailureDefinitionId CannotMirrorLoad { get; }` | `LoadFailures.CannotMirrorLoad` | FailureDefinitionId |
| `FailureDefinitionId CannotMoveHostedLoad { get; }` | `LoadFailures.CannotMoveHostedLoad` | FailureDefinitionId |
| `FailureDefinitionId CannotRotateLoad { get; }` | `LoadFailures.CannotRotateLoad` | FailureDefinitionId |
| `FailureDefinitionId InvalidAreaLoadSketchError { get; }` | `LoadFailures.InvalidAreaLoadSketchError` | FailureDefinitionId |
| `FailureDefinitionId LineLoadAllZero { get; }` | `LoadFailures.LineLoadAllZero` | FailureDefinitionId |
| `FailureDefinitionId LineLoadNotOverlappingHost { get; }` | `LoadFailures.LineLoadNotOverlappingHost` | FailureDefinitionId |
| `FailureDefinitionId OpenAreaLoadLoopError { get; }` | `LoadFailures.OpenAreaLoadLoopError` | FailureDefinitionId |
| `FailureDefinitionId PointLoadAllZero { get; }` | `LoadFailures.PointLoadAllZero` | FailureDefinitionId |
| `FailureDefinitionId PointLoadNotOverlappingHost { get; }` | `LoadFailures.PointLoadNotOverlappingHost` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```